{
  "config": {
    "ads": {
      "enabled": false,
      "adcolony": {
        "adcolony_app_id": "",
        "adcolony_interstitial_id": "",
        "adcolony_rewarded_id": ""
      },
      "admob": {
        "admob_banner_id": "ca-app-pub-3940256099942544/6300978111",
        "admob_interstitial_id": "ca-app-pub-3940256099942544/1033173712",
        "admob_native_id": "ca-app-pub-3940256099942544/2247696110",
        "admob_rewarded_id": "ca-app-pub-3940256099942544/5224354917",
        "admob_unit_id": ""
      },
      "appodeal": {
        "appodeal_app_key": ""
      },
      "facebook": {
        "facebook_banner_id": "",
        "facebook_interstitial_id": "",
        "facebook_native_id": ""
      },
      "unity": {
        "unity_app_id": "",
        "unity_banner_id": "",
        "unity_interstitial_id": "",
        "unity_rewarded_id": ""
      },
      "mode_ads_banner": "admob",
      "mode_ads_interstitial": "admob",
      "mode_ads_native_enabled": true,
      "mode_ads_rewarded": "admob",
      "mode_button_ads_action": "0"
    },
    "update": {
      "_comment": "action= , url, app id",
      "state": false,
      "title": "Update your app",
      "message": "New Version!",
      "action": "",
      "closeable": false
    },
    "exit": {
      "_comment": "type=banner, content=example - type=ad_native - type=banner, image=example link=example",
      "type": "ad_native",
      "image": "https://raw.githubusercontent.com/medprogrammer/configs/main/Webp.net-compress-image.jpg",
      "link": "https://raw.githubusercontent.com/medprogrammer/configs/main/Webp.net-compress-image.jpg"
    },
    "rating": {
      "enabled": true
    },
    "activities": {
      "splash": {
        "duration": 5000
      },
      "start": {
        "enabled": false,
        "loader": {
          "enabled": false,
          "duration": 4000
        }
      },
      "main": {
        "_comment": "more=developer id",
        "more": "5700313618786177705"
      },
      "list": {
        "item": {
          "_comment": "type = image, text, card",
          "type": "card",
          "loader": {
            "enabled": false,
            "duration": 3000
          }
        }
      }
    }
  },
  "data": {
    "items": [
      {
        "image": "https://www.pockettactics.com/wp-content/uploads/2020/07/Toca-Life-World-APK-900x506.jpg",
        "title": "Toca Life World",
        "description": "If you like online games that allow you to grow and nurture villas and build relationships with other players, then you will definitely want to check out The Toca Life World game. The graphics are excellent and everything else about it is just as exciting as it can get. If you haven't checked it out, it is definitely worth checking out. Who knows, you may find yourself becoming addicted to it. I'm not saying that would happen, but who knows!"
      },
      {
        "image": "https://play-lh.googleusercontent.com/k0DIQWnJP3SPIHWs8mWZT8F8HUJBC1etqPN3yAQoTkj6L7BQNQV7Cg24kX4onau5D2s=w720-h310-rw",
        "title": "Crumpets",
        "description": "The Crumpets are a collection of small cute creatures that have appeared throughout the Toca Life games , hiding in trees or under manhole covers . The Crumpets come in a wide variety of appearances and looks, each of their appearances relate to a area where they are found in."
      },
      {
        "image": "https://play-lh.googleusercontent.com/5sUp7xnJBjFXYu3lYY35p-dAtMusycuSaTg61Lmo6GA4T8UD7fQTRKsztpEVlktVcw=w720-h310-rw",
        "title": "Secrets",
        "description": "Many people do not know that condiments and sauces in Toca Life: World can be used to dye character’s hair. Many condiments can be found for free in the Food Court, such as hot sauce, ketchup, and soy sauce. Some sauces such as olive oil (found in the kitchen of the Fancy Restaurant) can be used to dye character’s hair but require an in-app purchase for access.

"
      },
      {
        "image": "https://play-lh.googleusercontent.com/JKVkncE1b55JzK9E7YCLQy7Ifaunm91oN_KlrVzZgbthvGjpxYrGetryd7N-TcPSybQ=w720-h310-rw",
        "title": "Nari",
        "description": "Nari is one of the 4 main Toca Mix videos characters.

APPEARANCE

Nari wears a white torso with a turquoise pocket with a pastel peach zipper across and light pink sleeves, one rolled up which reveals a lighter pink and the other hanging past her hand. Her hair is a very dark brown, nearly black colour. It’s always seen loose and just a little further down than her shoulders, and her fringe covers one eye. There are also two small triangles at the top of her head.


Nari is not mean

PERSONALITY

Nari is often described as “quirky” because of her careless nature. Examples of this are her frequent visits to the park to spy on unlucky victims, her cloud-like pet Croquet who can cook delicious food, and grow so large he could eat a human, and her odd sayings. She also can be very creepy, like in one of the first episodes when she made a pleasure song where she sang about the monsters in the apocalypse and how "the end times rule!!!" She also enjoys spying on her friends, as seen in the episode where she and Rita spied on Zeke and Leon. She also laughs when she purposefully scares her friends for pleasure as it can be funny to her sometimes. She also deeply cares about her imaginary friend that can only be seen by her unless someone knocks their head hard enough to let them see croquet. She also can summon crumpets although she also enjoys hunting for them and one time saved a village of crumpets with Zeke's help. She has a secret treehouse In the park which is totally huge!!! Nari is also a great and quirky friend and adventurer and someone most people would like to have around and a personal favorite of me and many other Toca Life World and MIX fans."
      },
      {
        "image": "https://static.wikia.nocookie.net/toca-life-world/images/3/34/Image.png/revision/latest/scale-to-width-down/185?cb=20181215112440",
        "state": "free",
        "title": "Bop City",
        "description": "Bop City is an area in Toca Life: World. It has 8 locations and 39 characters, with a total of 10 Crumpets. The area comes free with the game, and the locations there are mostly made up of Toca Life: City locations

Post Office (Exclusive) You can collect gifts every week.
Food Court (City)
Hair Salon (City)
Loft Apartment (City)
Department Store (City)
Theatre (City)
Tailor (City)
Storage (Exclusive) Crumpet Special"
      },
      {
        "image": "https://static.wikia.nocookie.net/toca-life-world/images/7/70/9BF18B60-1521-477C-AFB4-808685FDA4C0.jpeg/revision/latest/scale-to-width-down/370?cb=20210103222025",
        "title": "Rita",
        "description": "Toca world. Rita is one of the 4 main Toca Mix video characters.APPEARANCE me podrian desir si rita es hombre o mujer de: desconosido 2000


Rita is often shown as free-willed and careless, which she displays countless times. Despite being a lone wolf, she is a loyal friend to Leon, Zeke and Nari!

TRIVIA

-Making her first debut in Toca Life: City, Rita is found in the apartment on the turquoise sofa-bed.

-Rita‘s face appears on most of the Toca Life apps, including Toca Life City, Toca Life Afterschool, Toca LIfe Hospital and Most Iconic of all Toca life World


krazy Rita as a character in the game

- She might have a mutual crush on Leon hinted at in MIX."
      },
      {
        "image": "https://static.wikia.nocookie.net/toca-life-world/images/a/a9/Sugar.png/revision/latest/scale-to-width-down/180?cb=20200516182832",
        "title": "Sugar",
        "description": "The sugar is an ingredient that could be used to make food in toca life world.

Recipes:

Sugar+Cherry= Cherry Pie

Sugar+Pumpkin= Pumpkin Pie

I love a Bag of Sugar But why don’t you sell them in. bop city we need them in bop city!
Sugar+Apple= Apple Pie

Sugar+Blueberry= (Blue) Birthday cake where even the blueberry?

Sugar+Strawberries= (Pink) Birthday cake

Sugar + Egg= Macaron

This used too be so rare.
Now it is added in the home designer which makes it less valuable for my treasure hunt."
      },
            {
        "image": "https://play-lh.googleusercontent.com/6aGrlS6IWnwsZRi5gwOT1Jv8OwXuMYfxJZj-pKVd6I8KmfGQfV4xn-f90CNqgBDDVvI=w720-h310-rw",
        "title": "Rainbow Popsicle",
        "description": "The Rainbow Popsicle is a icy treat in Toca life Neon Rainbow Apartment. you can get it from the furniture button in the kitchen section and tap the bread icon ubove. the popsicle packet is there, when you are done taking out as many popsicles you want, either you open the packet or Eat the packet without opening, either way, you still have a Rainbow Popsicle!
"
      },
            {
        "image": "https://play-lh.googleusercontent.com/6aGrlS6IWnwsZRi5gwOT1Jv8OwXuMYfxJZj-pKVd6I8KmfGQfV4xn-f90CNqgBDDVvI=w720-h310-rw",
        "title": "Neon Rainbow Apartment",
        "description": "The Neon Rainbow Apartment is a home designer house. It includes:

- Rainbow Bunk-bed - Hanging bed - Heart shaped mat - Rainbow mat - Rainbow clothes hanger - Ladder - Table - Selfie lamp - light-up cactus - donut bean-bag - pink light mirror - Pink cabnet - star light - desk lamp - pink Table - Video game table+ TV - Make-up pallete - Make up pad - make-up brush - Lotion - body spray - Perfume - Heart Night lights - Pink Locker - Stapler - Backpack - pencil - pen - pencil case - pictures - camera - pink computer - Highlighters - rainbow, heart and cloud wall light - disco ball - frog and bunny plant pots - pink stool - blue fridge - pink toilet - pink and white island table - blue microwave - blue toaster - blue sun chair - rainbow pool toy - big purple radio - blue chairs - pink chairs - wheeled pink chair - pink couch - pink shower - pink sink - blue oven - blue sink - three pins - backpack holder - + many more

The rainbow apartment does not have any crumpets.
You can get cheesy bop and rainbow popsicle in the rainbow apartment. the neon rainbow apartment has 5 rooms. You can also get school supplies and a candy machine. It is similar to the kitty girl (in toca life neighborhood)'s house. you can find a broken toaster in crumpet junkyard just like the rainbow apartment one."
      },
           {
        "image": "https://play-lh.googleusercontent.com/6aGrlS6IWnwsZRi5gwOT1Jv8OwXuMYfxJZj-pKVd6I8KmfGQfV4xn-f90CNqgBDDVvI=w720-h310-rw",
        "title": "Vox Valley",
        "description": "Vox Valley is an area from Toca Life: World. it has 3 Locations and 27 Characters, With a total of 3 Crumpets. it is one of the 4 locations to only appear in Toca Life: World, the others being Pom Pom Peeks Creators Campus and Morning Meadows.

Locations
Wildlife
University
Movie Studio"
      },
                  {
        "image": "https://static.wikia.nocookie.net/toca-life-world/images/5/5a/SushiResturantIMG1.png/revision/latest/scale-to-width-down/220?cb=20201025044028",
        "title": "Food Court",
        "description": "The food court is located in Bop City, and in the base game of Toca City, it consist of 7 food trucks that sell different types of foods.

Food Choice
McDonald's (fast food and sweets)
Burger King (burgers)
Subway (sandwiches)
Popeye's (chicken)
Chick-Fil-A (chicken)
Pizza Hut (pizza)
Andy Seafood Market (seafood place)
Chick-Fil-A

Screenshot of the Sushi Restaurant in the Food Court

Chick-Fil-A has chicken sandwiches, fries, soda's, and chicken nuggets.

Burger King

Screenshot of Curry Cart in the Food Court

Burger King has fries, burgers, and soda's.

McDonald's
McDonald's has fries, chicken nuggets, apple pies, milkshakes, and soda s."
      }
    ]
  }
}
