{
  "config": {
    "ads": {
      "enabled": true,
      "adcolony": {
        "adcolony_app_id": "",
        "adcolony_interstitial_id": "",
        "adcolony_rewarded_id": ""
      },
      "admob": {
        "admob_banner_id": "ca-app-pub-9544890911830067/4435713425",
        "admob_interstitial_id": "ca-app-pub-9544890911830067/2739488370",
        "admob_native_id": "ca-app-pub-9544890911830067/5557223404",
        "admob_rewarded_id": "",
        "admob_unit_id": ""
      },
      "appodeal": {
        "appodeal_app_key": ""
      },
      "facebook": {
        "facebook_banner_id": "",
        "facebook_interstitial_id": "",
        "facebook_native_id": ""
      },
      "unity": {
        "unity_app_id": "",
        "unity_banner_id": "",
        "unity_interstitial_id": "",
        "unity_rewarded_id": ""
      },
      "mode_ads_banner": "admob",
      "mode_ads_interstitial": "admob",
      "mode_ads_native_enabled": true,
      "mode_ads_rewarded": "admob",
      "mode_button_ads_action": "0"
    },
    "update": {
      "_comment": "action= , url, app id",
      "state": false,
      "title": "Update your app",
      "message": "New Version!",
      "action": "",
      "closeable": false
    },
    "exit": {
      "_comment": "type=banner, content=example - type=ad_native - type=banner, image=example link=example",
      "type": "banner",
      "image": "https://raw.githubusercontent.com/medprogrammer/configs/main/Webp.net-compress-image.jpg",
      "link": "https://raw.githubusercontent.com/medprogrammer/configs/main/Webp.net-compress-image.jpg"
    },
    "rating": {
      "enabled": false
    },
    "activities": {
      "splash": {
        "duration": 3000
      },
      "start": {
        "enabled": true,
        "loader": {
          "enabled": true,
          "duration": 4000
        }
      },
      "main": {
        "_comment": "more=developer id",
        "more": "5700313618786177705"
      },
      "list": {
        "item": {
          "_comment": "type = image, text, card",
          "type": "image",
          "loader": {
            "enabled": true,
            "duration": 5000
          }
        }
      }
    }
  },
  "data": {
    "items": [
      {
        "image": "https://play-lh.googleusercontent.com/dFSnVPKeSfiPh2U5uK6ZgPxVAhOlauCV_JOxhEORrSBIkz3kG4TrfIM5JQfuUsqo2PE",
        "title": "HUMAN FALL FLAT OVERVIEW
",
        "description": "1. Human Fall Flat Walkthrough 
Hi, and welcome to the TrueAchievements walkthrough for Human Fall Flat. This is a material science based riddle platformer with some lovely one of a kind, and now and again disappointing, controls, which has the player exploring through 12 unique levels navigating the landscape and finishing riddles to get to the exit at each level.
This walkthrough will be separated into segments dependent on levels. Each level will have a book walkthrough, and the initial nine levels have video walkthroughs went with them.
You're taking a gander at around a 8-10 hour fulfillment by and large. Be cautioned that there is an accomplishment for finishing the whole game at a time for the Speedrun accomplishment, and this will currently expect you to beat the Aztec, Dark, Steam and Ice levels also notwithstanding the primary 8 levels (Thermal and Factory are apparently not piece of the fundamental game and don't tally towards the accomplishment). While you can in fact get all accomplishments in one playthrough, you'll need to put aside a heavy piece of time to beat the whole game at a time while getting the wide range of variousaccomplishments, and afterward play the game again zeroing in simply on beating the levels as quick as could reasonably be expected and nothing else to complete the Speedrun accomplishment which will take you around 2-3 hours. It likewise may take you a piece to become acclimated to the controls, however I'll cover that in the overall clues and tips. At the point when I began this game the controls really baffled me to where I needed to quit playing for a piece, yet whenever you're utilized to it you'll be climbing objects right away.
Discussing controls, lets head over to the General Hints and Tips so we can plunge into the controls in more detail."
      },
      {
        "image": "https://play-lh.googleusercontent.com/ofILm5lsDr_O8ufBt5PKHxGbNbUjF1txVVDeJjFNz9CgWAJP-mX72DcVI8ziVy9Bfw=w720-h310-rw",
        "title": "LEVEL 1 - MANSION
",
        "description": "LEVEL 1 - MANSION
Just a reminder that there may be an success for finishing the sport in a single sitting along with the primary 4 update / DLC ranges (as much as Ice, as Thermal and Factory appear to be cut loose the primary recreation and do now no longer count). This method that you can't go out the sport at any factor even as going for the success. Reloading from checkpoints and restarting ranges through the pause menu should not void the success, however it is probably satisfactory to keep away from doing this to be at the secure side, so in case you reduce to rubble any achievements and must reload a checkpoint to strive for it again, you could simply hold on going and replay the extent later to get the success(s). Keep all of this in thoughts if you want to do the whole thing in a single playthrough."
      },
      {
        "image": "https://play-lh.googleusercontent.com/zEtAm1MRS4gbdaQDig7w5F5wfbW81aQJQWJ7v_Egkn3jMbpp2MVzXVwf3ZPntCvZLA=w720-h310-rw",
        "title": "LEVEL 2 - TRAIN
",
        "description": "
LEVEL 2 - TRAIN
Now that you have completed your civic obligation for the level, flip round and you will see a few pink teach vehicles in an L shape. You'll need to drag the only this is parallel to the bench you simply constant in the direction of it is yellow bearings so that you're capable of push the teach automobile this is parallel with the door you need to undergo onto it is yellow bearings and out of the manner of the door. Once you have completed that, head via the door into the following place. You'll see greater pink teach vehicles, one at the floor and one on a raised platform. Jump on pinnacle of the pink teach automobile at the floor, after which leap and pull your self as much as the pink teach automobile at the top level. Head to the left of this and push the teach automobile off the ledge so that you can continue via the door it turned into blocking.
In this subsequent place you will be in a park with a pink field automobile. What you want to do is cross at the pink field automobile and clutch onto the wall. While you are retaining onto the wall, you want to stroll to the left, and as you are doing this, you will note the field automobile shifting in the direction of the right (physics!). Keep doing this, readjusting your self so that you do not fall off, till you are capable of leap to the  platform with the round the corner and push the button to open the door and head right into a hallway wherein you need to push some other button to open some other door to go on via.
Climb up the set of stairs and you will see 3 field vehicles. Climb up the second one set of stairs and stroll onto the pink field automobile. Grab onto the pillar and stroll to the right, pushing the field automobile to the left. You can most effective cross up to now though, so after you attain the stop you will should visit the second one pillar and repeat. Keep doing this, repositioning if necessary, till you are capable of hop at the field automobile with timber planks on both aspect of it. From here, hop throughout to the lengthy field automobile and stroll down it. Walk up the set of stairs over here, push the button to open the door, and stroll on via. As you are falling, you will unlock:"
      },
      {
        "image": "https://play-lh.googleusercontent.com/5rIW4LJvqmmaNKqpQl8bEwNnFbld8jR2ZkUQBVFbeCDAyVmWECQgMqYv5grrG7xvYzKZ=w720-h310-rw",
        "title": "LEVEL 3 - CARRY",
        "description": "LEVEL 3 - CARRY
Now lower back to the a laugh stuff, first aspect you want to do is choose up the field near you and region it at the button. Doing this may open the door to the subsequent location. Now we're going to be putting in place for the Tower achievement, which calls for us to stack all four bins withinside the degree on pinnacle of every other. If the textual content is simply too tough to follow, genuinely use the video walkthrough for it. The degree is damaged up into four areas, with the primary location being the location you spawn and the final phase being the location with the go out door. Grab the field at the ledge on your left and convey it lower back into the location in which you spawned. Now take hold of the field this is presently at the button and take it off. Grab the field you took from the second one location and region it at the button.

Now earlier than we preserve we are gonna take a touch pause for any other miscellaneous achievement. Place the field that became formerly at the button withinside the center of the door heading to the second one location. Head lower back to the button and take the field off of it and region it beside it. You'll observe the opposite field is conserving the door open. Jump on pinnacle of the field caught withinside the door and hold on foot ahead till you limbo via the door."
      },
      {
        "image": "https://play-lh.googleusercontent.com/B9eMaHKdHqAgBRB9EzhmoNSIbUNhcJW3nYgBumhBLEOX2y7tFLgfxPUR1k_xEHWB--4=w720-h310-rw",
        "state": "free",
        "title": "LEVEL 4 - MOUNTIAN",
        "description": "Welcome to the extent 4, the mountain level. This is in which your platforming talents genuinely get positioned to the test. Walk ahead and leap throughout to the platform, then leap throughout this to some other platform. There are a group of structures right here in an S like form that you need to traverse, so actually maintain your palms out (if you flub your leap) and leap throughout the structures. If you fall off, there's a walkie talkie at the ground, and beside that is a ledge you may climb lower back up. Once you are accomplished traversing these, you may attain a wall with a few ledges. This is in which the sport officially teaches you approximately pulling your self up onto ledges via way of means of leaping, grabbing on, and searching down with the proper stick to tug your self up, however in case you studied the overall tips and guidelines you will be a grasp at this via way of means of now. Use your new (old) talents to climb up the ledges, and as soon as you are up pinnacle you may see a purple container vehicle on your left, however we do not need to move there simply yet. Instead, flip to the proper and you will see a few ledges at the face of some other wall. Jump throughout the 2 ledges, climb as much as some other one, then leap down and throughout extra structures (ensure you leap to the furthest platform you may, you may attempt to threat leaping from the second one furthest one, however in case you fall you need to traverse the S structures once more). From this furthest platform, leap throughout to the subsequent place and you will see a gap to move withinside the mountain, so stroll on in.In this place, we are going to pass for the My Treasure achievement, which calls for you to get 7 gemstones withinside the mountain and organization them together. Now it's miles extraordinarily darkish in right here, so you will need to deliver a lantern with you. However, you may depart the lantern in a few key locations because the gemstones supply off a inexperienced glow that you may sort of see. I'm going to move little by little of what I did to attain this, and in case you do not need to examine a block of text, experience unfastened to observe the video walkthrough.Walk in and take hold of the lantern to the left. Once you've got got it, stroll instantly and you will find gem 1/7. Drop the lantern, select out up the gem, and region it simply to the proper of this hollow in case you're dealing with it, which additionally takes place to be at the lowest of a ramp. Walk up this ramp and veer barely to the proper on the pinnacle and you will see gem  in an alcove to the left. Drop your lantern in among the 2 alcoves, select out up the gem, and backpedal to the ramp you simply got here up, pass down, and region this gem beside the opposite one. Head lower back up the ramp lower back on your lantern and select out it up. Walk as much as the proper and you will attain extra alcoves, and the only to the proper contains gem . Drop your lantern in among the 2 alcoves and select out up this gem, backpedal to the ramp, head down and drop it for your gem pile. Work your manner lower back to the lantern, select out it up, and flip around. Beside the ramp that is going on your gem pile is some other ramp that is going up. Walk up it and veer barely to the left, then stroll ahead and you will come to a fork withinside the path. Drop your lantern right here and depart it right here. In the alcove to the proper is gem . Pick it up, take it lower back on your pile, drop it off, then head lower back on your lantern. On your manner, rather than going left closer to your lantern, visit the proper and observe the wall and you will find gem. Before you head lower back, observe the proper wall once more and it will lead you to some other alcove with gem . Take it lower back on your pile, drop it off, and head lower back to drop them off. Pick up your lantern and head to the left, and in an alcove at the proper is gem. Take this lower back on your pile."
      },
      {
        "image": "https://play-lh.googleusercontent.com/_tCr7gbUgaf6ikcCoIdl7li0CJoeXpTKnWqtYF4Ieugw4o5kOzCUDgNcjzOCxcKBB2o=w720-h310-rw",
        "title": "LEVEL 5 - DEMOLITION",
        "description": "Now for the duration of your speedrun you could preserve thru the opposite aspect of this constructing and pass approximately 1/2 of the map, however for the cause of this walkthrough I'm going to cowl the opposite 3 regions as well. Climb again out the window and head over to the wall at the proper. Pick up your hearthplace extinguisher and begin smacking the wall with it till it breaks. Once it does, with a purpose to be wall 1/4 for a miscellaneous achievement. In this subsequent region, there may be any other wall simply a piece in the front of you in your left. Smack this wall together along with your hearthplace extinguisher too to break wall 2/4.In the subsequent region there can be conveyor platforms, one raised and one decreased, a lever, a pitcher room with a button in it, and a container. First, cross over to the conveyor platform this is raised and pull the yellow pole out from below it. Doing this could motive that platform to lower. Climb as much as the ledge and stroll to the stop of the now decreased platform. Jump throughout to the ledge on the opposite aspect and hit the lever beside the glass room, which increases the conveyor platform that became decreased so that you can stroll again throughout the gap. Now leap as much as the ledge, and seize the container. Carry the container again throughout the platform, damage the glass with the container, and vicinity the container at the button which opens the door to the subsequent region. Once you are in the subsequent region, you may see a platform with yellow poles below it, and a lever in your proper with a blue wall at the back of it. Pull each yellow poles out from below the platform and it'll lower. Now you want to take a yellow pole and vicinity it horizontally at the back of the lever and towards the blue wall. This will motive the pole to fall at the lever, preserving it held down and preserving the door open for you, so head on thru.This subsequent region includes a lever, a button in your the front left, a swinging platform, and a container at the a long way aspect throughout the gap. First component you want to do is circulate the swinging platform into the center of the gap, that manner it swings again and forth, with contrary ends touching (or near) each facets of the gap. Head on down and leap throughout to the swinging platform and leap from right here to the opposite aspect. Grab the container and take it again to the swinging platform. When it swings near you, leap on it with the container. When it swings near the opposite aspect, leap off it with the container and vicinity it at the button. Traverse again over this platform and head into the subsequent region. In this region, there may be a wall in the front of you in your proper, however earlier than we address that, we are going to climb up the blue scaffolding to our instant proper. Once you get to the top, you may see a door this is barricaded. Lift up the barricade and you will be rewarded with a wonder and an achievement:"
      },
      {
        "image": "https://play-lh.googleusercontent.com/2ZLvQYb5OWu5cTIfDCtuQxk4BJKNgm4yUZpZ9HZ16WuLYpZ5Ei57NJeCyXQYEJPsn6U=w720-h310-rw",
        "title": "LEVEL 6 - CASTLE",
        "description": "LEVEL 6 - CASTLE
Now do not soar off right here, keep using to the hollow withinside the wall. Now from the hollow withinside the wall you simply got here from, soar out to the platform simply out of doors of it, then soar up once more to the subsequent platform and soar thru the window. Walk thru the entrance and alongside the pathway right here and you may come to a crank. Turn it and you may open the door to the subsequent region. Jump down and head thru the door and you may be on a bridge and you may see a hook and a lantern on a rock withinside the distance. Grab the hook and try to hook the chain of the lantern to get it down. Once it is down, soar and grasp the lantern and swing from side to side on it in the direction of the handiest rock platform you may attain simply in your right. Walk up and you may technique the windmill. There's a barrel beneathneath the platform, and from this barrel you may soar to the subsequent section. Line your self up with the barrel and run and soar off the edge, grabbing directly to the quit of the alternative region and pulling your self up. If you are suffering simply seek advice from the video walkthrough.

Now on this region, we are going to bypass a alternatively traumatic puzzle and use the cheese technique to climb up the gray wall to the left. Once up right here, grasp the 2 planks of wooden off the hollow and stack them on pinnacle of every different the nice you may at the grass hill in the front of the shortest platform withinside the tree. From those stacked planks, soar as much as the plank withinside the tree and pull your self up. Jump as much as the subsequent platform and grasp the bucket. With the bucket in hand, soar into the hollow. Once you are down into the hollow as a ways as you may cross at the bucket, you need to try to swing your self to a platform at the returned of the cave wall. If you fall now no longer to worry, there's a direction going returned up you may take. Following the direction, you may attain a platform you may soar to. This platform will fall after you soar on it, so simply dangle on and trip it to the alternative side. Once right here, push the boulder down and it's going to knock down a platform. Jump down and stroll up this platform and you may see some other platform you may soar to to the right. Jump to it and it's going to begin falling, so trip it to the subsequent platform. Walk alongside this platform and soar to the subsequent one at the left, with a purpose to additionally begin falling. Jump while it nearly falls absolutely over and you may be withinside the final region of the level.

Once on this region, stroll over to the drawbridge. Jump up onto the ledge then soar and grasp onto the drawbridge. It will collapse and display a gate with a hollow in it. You want to release your self thru the hollow (or near sufficient with the intention to climb thru). Pull it returned 10 footsteps, decrease the sling and release your self. This have to land you shut up sufficient to the hollow that you may move slowly thru. If now no longer, readjust as necessary. Once you are thru the door, the go out will open under you. Fall thru and as you are falling you may unlock:"
      },
      {
        "image": "https://play-lh.googleusercontent.com/Tn446nrvRTqD8G7_nx18-jhGS-qFsqdJFNuxWwVZaNzcnpS69gtLg8BK51GByNLIKQ=w720-h310-rw",
        "title": "LEVEL 7 - WATER",
        "description": "
Now hop off your boat, throughout the timber structures and onto the tanker. Climb up till you attain the manage deck to be able to speak. In here, there may be levers. The subsequent miscellaneous success we are able to be going for calls for us to opposite this tanker into its dock. Now even after gambling round with them for a piece I wasn't completely positive which did what, so I'm going to give an explanation for what I did to govern it. While dealing with out the window of the manage deck, I driven the lever at the left all of the manner ahead and left it, then I pulled the lever at the proper backwards and the boat began out turning to the proper. I permit it flip till the the front of the boat changed into coated up in among the pink and inexperienced buoys. Once you are coated up with this, I driven the proper lever all of the manner ahead and drove the tanker ahead till you may now not see the remaining inexperienced buoy at the left hand side. I then pulled the lever at the proper lower back all of the manner and permit the boat flip till its rear changed into coated up with the canal in among the docks. Once it changed into coated up, I positioned the lever at the proper lower back in its beginning function withinside the center and pulled the lever at the left lower back to position the tanker in opposite. Then I permit pass of the left lever and became round to stand the rear of the boat and grabbed the proper lever. I watched it lower back into the docking location and made changes to the location with the proper hand lever. Once it is in, permit it opposite till it can not pass anymore and you may unlock:"
      }
    ]
  }
}
